function R = calculateR3(xxx, n, S, P, D, q, C, Y_r_D1, Y_r_D2, Y_r_q, Y_r_C1, Y_r_C2, Y_r_P1, Y_r_P2)
% 预期售价P
% 预期销售量D
% 预期亩产量q
% 预期每亩成本C

% 改变预期销售量矩阵
% 玉米（7列）和小麦（6列）单独变化
D(:,[6,7]) = D(:,[6,7])* Y_r_D1(n);
% 其余农作物
D(:,[1:5 8:end]) = D(:,[1:5 8:end])* Y_r_D2(n);

% 改变亩产量矩阵q
q = q.*Y_r_q(n);

% 改变成本矩阵C
C = C.*Y_r_C1(n);

% 改变售价矩阵，蔬菜17~37，使用菌38~40，羊肚菌41
P(:,17:37) = P(:,17:37)*Y_r_C2(n);
P(:,38:40) = P(:,38:40)*Y_r_P1(n);
P(:,41) = P(:,41)*Y_r_P2(n);

xxx = xxx./sum(xxx,2);
Q1 = xxx.*S;
Q1(isnan(Q1)) = 0;
Q_1(1,:) = sum(Q1(1:6,:));
Q_1(2,:) = sum(Q1(7:20,:));
Q_1(3,:) = sum(Q1(21:26,:));
Q_1(4,:) = sum(Q1(27:34,:));
Q_1(5,:) = sum(Q1(35:50,:));
Q_1(6,:) = sum(Q1(51:54,:));
Q_1(7,:) = sum(Q1(55:62,:));
Q_1(8,:) = sum(Q1(63:78,:));
Q_1(9,:) = sum(Q1(79:82,:));

Q_11 = Q_1.*q;

R = sum(P.*min(Q_11,D) + 0.5*P.*max(Q_11-D,0) - C.*Q_1, "all");
end